{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_1",
            "layers": [
                {
                    "class_name": "Conv2D",
                    "config": {
                        "filters": 4,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_in",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            5,
                            5
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_1",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            20,
                            20,
                            1
                        ],
                        "dtype": "float32"
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "name": "maxPooling2d_1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "filters": 5,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_in",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "kernel_regularizer": null,
                        "kernel_constraint": null,
                        "kernel_size": [
                            5,
                            5
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "conv2d_2",
                        "trainable": true
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "name": "maxPooling2d_2",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_Flatten1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 10,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_in",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_1",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "tfjs-layers 4.8.0",
        "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.8.0",
    "convertedBy": null,
    "weightsManifest": [
        {
            "paths": [
                "./model.weights.bin"
            ],
            "weights": [
                {
                    "name": "conv2d_1/kernel",
                    "shape": [5,5,1,4],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [4],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/kernel",
                    "shape": [5,5,4,5],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/bias",
                    "shape": [5],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [20,10],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [10],
                    "dtype": "float32"
                }
            ]
        }
    ]
}